In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4,5,6])
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
s[2]

3

In [4]:
s = pd.Series({'math':10, 'leng':7, 'art':2})
s

math    10
leng     7
art      2
dtype: int64

In [5]:
s['math']

10

In [6]:
print(s.size)
print(s.index)
print(s.dtype)

3
Index(['math', 'leng', 'art'], dtype='object')
int64

In [7]:
print(s[0])
print(s[1])
print(s[1:])
print(s[:2])
print(s[['leng','art']])

10
7
leng    7
art     2
dtype: int64
math    10
leng     7
dtype: int64
leng    7
art     2
dtype: int64

In [8]:
s = pd.Series([1,2,3,4,5,6])

print(s.count())
print(s.value_counts())
print(s.value_counts(normalize=True))
print(s.min())
print(s.max())
print(s.var())
print(s.std())

6
1    1
2    1
3    1
4    1
5    1
6    1
dtype: int64
1    0.166667
2    0.166667
3    0.166667
4    0.166667
5    0.166667
6    0.166667
dtype: float64
1
6
3.5
1.8708286933869707

In [9]:
print(s.describe())

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [10]:
s * 2

0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

In [11]:
s % 2

0    1
1    0
2    1
3    0
4    1
5    0
dtype: int64

In [12]:
st = pd.Series(['a','b','c'])
st * 4

0    aaaa
1    bbbb
2    cccc
dtype: object

In [13]:
import math

s.apply(math.log)

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
5    1.791759
dtype: float64

In [14]:
import numpy as np
s.apply(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
5    2.449490
dtype: float64

In [15]:
st.apply(str.upper)

0    A
1    B
2    C
dtype: object

In [16]:
s.apply(lambda x:x*2+3)

0     5
1     7
2     9
3    11
4    13
5    15
dtype: int64

### Filtrar y Ordenar ###

In [17]:
print(s[s > 2])

2    3
3    4
4    5
5    6
dtype: int64

In [18]:
s.sort_values()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [19]:
s.sort_index(ascending=False)

5    6
4    5
3    4
2    3
1    2
0    1
dtype: int64

In [20]:
sx = pd.Series(['a','b', None,'c',np.nan,'d'])
print(sx)

sy = sx.dropna()
print(sy)

0       a
1       b
2    None
3       c
4     NaN
5       d
dtype: object
0    a
1    b
3    c
5    d
dtype: object

## DATAFRAMES

### CREACIÓN

In [26]:

diccionario = {'nombre': ['María', 'Luis', 'Carmen', 'Antonio'],'edad': [18, 22, 20, 21],'grado': ['Economía', 'Medicina', 'Arquitectura', 'Economía'],'correo': ['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']}
       
lista_de_listas = [['María', 18],['Luis', 22],['Carmen', 20]]
                  
lista_de_dicts = [{'Nombre': 'María', 'Edad': 18},{'Nombre': 'Luis', 'Edad': 22},{'Nombre': 'Carmen'}]

In [27]:
df = pd.DataFrame(diccionario)
df

    nombre  edad         grado             correo
0    María    18      Economía    maria@gmail.com
1     Luis    22      Medicina      luis@yahoo.es
2   Carmen    20  Arquitectura   carmen@gmail.com
3  Antonio    21      Economía  antonio@gmail.com

In [28]:
df = pd.DataFrame(lista_de_listas)
df

        0   1
0   María  18
1    Luis  22
2  Carmen  20

In [29]:
df = pd.DataFrame(lista_de_dicts)
df

   Nombre  Edad
0   María  18.0
1    Luis  22.0
2  Carmen   NaN

### DESDE FUENTES

In [2]:
import pandas as pd

dfcol = pd.read_csv('../Pandas/datos/colesterol.csv')
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [4]:
dfcolweb = pd.read_csv('https://raw.githubusercontent.com/ricardoahumada/DataScienceBasics/refs/heads/main/data/colesterol.csv')
dfcolweb

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [5]:

dffr = pd.read_json('../Pandas/datos/frutas.json')
dffr

       apples  oranges
Luis        3        0
Ana         2        3
Juana       0        7
Pedro       1        2

In [8]:
import sqlite3

con_sqlt = sqlite3.connect("../Pandas/datos/database.db")

dfdb = pd.read_sql_query("SELECT * FROM movies", con_sqlt)
con_sqlt.close()

dfdb

,title,movieId,genres
0,Toy Story (1995),1,Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),2,Adventure|Children|Fantasy
2,Grumpier Old Men (1995),3,Comedy|Romance
3,Waiting to Exhale (1995),4,Comedy|Drama|Romance
4,Father of the Bride Part II (1995),5,Comedy
...,...,...,...
9737,Black Butler: Book of the Atlantic (2017),193581,Action|Animation|Comedy|Fantasy
9738,No Game No Life: Zero (2017),193583,Animation|Comedy|Fantasy
9739,Flint (2017),193585,Drama
9740,Bungo Stray Dogs: Dead Apple (2018),193587,Action|Animation
9741,Andrew Dice Clay: Dice Rules (1991),193609,Comedy

In [18]:
dfxls0 = pd.read_excel("../Pandas/datos/FoodMarket.xlsx", sheet_name = 0)   # Tambien se puede poner sheet_name = 'Purchases'
dfxls0

      Code  Product  Seller  Buyer      Fecha  Quantity
0        1       15      37     90 2020-11-10        25
1        2       46      32     51 2020-09-19        16
2        3       44      27    166 2019-02-19        25
3        4       52      21     68 2020-06-08        40
4        5       20      21    185 2019-01-18        36
...    ...      ...     ...    ...        ...       ...
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

[1501 rows x 6 columns]

In [15]:
dfxls1 = pd.read_excel("../Pandas/datos/FoodMarket.xlsx", sheet_name = 1)
dfxls1

    Product                    Name.x  provider      Price
0        65                     Tapas         4  35.811033
1        26  Foods named after people         1  10.396466
2        18                   Cookies         1  11.826661
3         7                    Breads         1   9.976362
4        56                   Seafood         3  30.673022
..      ...                       ...       ...        ...
65       58                Sandwiches         3  29.721142
66       42          Korean beverages         2  17.103079
67       39           Japanese dishes         1   8.784564
68       27            French cheeses         1   8.876323
69       44           Moroccan dishes         2  21.827039

[70 rows x 4 columns]

### EXPORTAR

In [19]:
dfxls0.to_csv('../Pandas/datos/Purchases.csv')

In [ ]:
con_sqlt = sqlite3.connect("../Pandas/datos/database.db")

d.to_sql(name="Purchases", con=con_sqlt)

con_sqlt.close()

### ATRIBUTOS

In [21]:
dfxls0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1501 entries, 0 to 1500
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Code      1501 non-null   int64
 1   Product   1501 non-null   int64
 2   Seller    1501 non-null   int64
 3   Buyer     1501 non-null   int64
 4   Fecha     1501 non-null   datetime64[ns]
 5   Quantity  1501 non-null   int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 70.5 KB

In [24]:
dfxls0.size
dfxls0.shape

(1501, 6)

In [28]:
print(dfxls0.columns)
print(dfxls0.index)
print(dfxls0.axes)

Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=1501, step=1)
[RangeIndex(start=0, stop=1501, step=1), Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')]

In [29]:
print(dfxls0.values)

[[1 15 37 90 Timestamp('2020-11-10 00:00:00') 25]
 [2 46 32 51 Timestamp('2020-09-19 00:00:00') 16]
 [3 44 27 166 Timestamp('2019-02-19 00:00:00') 25]
 ...
 [1499 28 5 81 Timestamp('2020-03-02 00:00:00') 31]
 [1500 21 2 194 Timestamp('2021-02-18 00:00:00') 35]
 [1501 33 8 120 Timestamp('2020-03-13 00:00:00') 12]]

In [30]:
print(dfxls0.dtypes)

Code                 int64
Product              int64
Seller               int64
Buyer                int64
Fecha       datetime64[ns]
Quantity             int64
dtype: object

In [33]:
dfxls0.head(10)

   Code  Product  Seller  Buyer      Fecha  Quantity
0     1       15      37     90 2020-11-10        25
1     2       46      32     51 2020-09-19        16
2     3       44      27    166 2019-02-19        25
3     4       52      21     68 2020-06-08        40
4     5       20      21    185 2019-01-18        36
5     6       23      46    120 2019-03-05        39
6     7       31      34    128 2019-05-28        28
7     8       45      23    157 2020-09-16        36
8     9       38       8      8 2020-06-17        24
9    10       43       9     22 2019-04-06        33

In [31]:
dfxls0.tail(10)

      Code  Product  Seller  Buyer      Fecha  Quantity
1491  1492       28      13    159 2019-04-06        28
1492  1493       10       9    104 2020-07-22        37
1493  1494        6      13     98 2020-07-20        20
1494  1495        8      38    166 2020-09-06        41
1495  1496       50       7    151 2020-12-22        34
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

In [35]:
dfxls0.describe()

              Code      Product       Seller        Buyer     Quantity
count  1501.000000  1501.000000  1501.000000  1501.000000  1501.000000
mean    751.000000    34.712192    28.788141   104.956696    31.341106
std     433.445691    19.974111    16.557750    59.825625     7.333365
min       1.000000     1.000000     1.000000     1.000000    12.000000
25%     376.000000    17.000000    14.000000    51.000000    26.000000
50%     751.000000    34.000000    28.000000   106.000000    31.000000
75%    1126.000000    52.000000    43.000000   158.000000    37.000000
max    1501.000000    70.000000    58.000000   207.000000    50.000000

### RENOMBRAR Y MODIFICAR: INDICES Y COLUMNAS

In [40]:
dfm = dfcol.rename(columns={'nombre':'nombre y apellido', 'peso':'pesos'}, index={0:1000})        # si añadimos }, inplace = true) lo sobreescribe en la el archivo original

In [41]:
dfm.set_index("nombre y apellido")

                                 edad sexo  pesos  altura  colesterol
nombre y apellido
José Luis Martínez Izquierdo       18    H   85.0    1.79       182.0
Rosa Díaz Díaz                     32    M   65.0    1.73       232.0
Javier García Sánchez              24    H    NaN    1.81       191.0
Carmen López Pinzón                35    M   65.0    1.70       200.0
Marisa López Collado               46    M   51.0    1.58       148.0
Antonio Ruiz Cruz                  68    H   66.0    1.74       249.0
Antonio Fernández Ocaña            51    H   62.0    1.72       276.0
Pilar Martín González              22    M   60.0    1.66         NaN
Pedro Gálvez Tenorio               35    H   90.0    1.94       241.0
Santiago Reillo Manzano            46    H   75.0    1.85       280.0
Macarena Álvarez Luna              53    M   55.0    1.62       262.0
José María de la Guía Sanz         58    H   78.0    1.87       198.0
Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
Carolina Rubio Moreno              20    M   61.0    1.77       194.0